var data=[
    {
        "id": "1",
        "text": "商人：最近行情不错，晶石生意想参与一下嘛？",
        "pic": "1.png",
        "type": "single",
        "responsetext1":"1.刚好买一些晶石备用。",
        "responsetext2":"2.我这里有很多晶石，卖一些给你。",
        "responsestat1":[5,10,-5,3,0,0,2,1,2,3,2,1,2,3,3,0,0,0,0,0,0,0],
        "responsestat2":[5,10,-5,3,0,0,2,1,2,5,2,1,2,3,3,0,0,0,0,0,0,0]

    },
    {
        "id": "2",
        "text": "商人：我这里正需要人手，要不要来打零工换些金币？",
        "pic": "1.png",
        "type": "multiple",
        "responsetext1":"1.我刚好想找份工作赚点金币。",
        "responsetext2":"2.浪费我的时间。",
        "connected":[5,6],
        "responsestat1":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        "responsestat2":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]


    },  {
        "id": "3",
        "text": "商人：我这里正需要人手，要不要来打零工换些金币？",
        "pic": "1.png",
        "type": "single",
        "responsetext1":"1.我刚好想找份工作赚点金币。",
        "responsetext2":"2.浪费我的时间。",
        "responsestat1":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        "responsestat2":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]
    },
    {
        "id": "4",
        "text": "商人：我这里正需要人手，要不要来打零工换些金币？",
        "pic": "1.png",
        "type": "multiple",
        "responsetext1":"1.我刚好想找份工作赚点金币。",
        "responsetext2":"2.浪费我的时间。",
        "connected":[5,6],
        "responsestat1":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        "responsestat2":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]


    }
];